# Сообщения для пользователя

MSG1 = 'Добро пожаловать в телефонный справочник!'
MSG2 = "\nЭтот телефонный справочник содержит ФИО и тел.номер.\n\
Вы находитесь в основном меню.\n\
Для перехода в меню действий с данными введите '1',\n\
Для выхода из программы введите '0'.\n\
Ввод: "
MSG3 = '\nВведите Фамилию Имя Отчество: '
MSG4 = 'Введите номер телефона: '
MSG5 = '\nВведите искомые данные: '
MSG6 = '\nСправочник не существует, возможно, он не был создан или был удален'
MSG7 = "\nВы находитесь в меню действий с данными.\n\
Для ввода данных введите '1',\n\
Для поиска данных введите '2',\n\
Для вывода всех контактов введите '3'.\n\
Для замены данных введите '4'.\n\
Для удаления данных введите '5'.\n\
Для выхода в основное меню введите '0'.\n\
Ввод: "
MSG8 = "|------------------------------------------------------------------------------|"
MSG9 = '\nВсего доброго!'
MSG10 = '\nВведите Данные, которые необходимо заменить: '
MSG11 = 'Введите новые данные: '
MSG12 = '\nВведите новые данные, которые необходимо удалить: '